Repository: prospereze12345-spec/Eduprompt
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr, sw, tw, zu

source: Generate unique essays that are perfect as a starting point for your work.
fr: Générez des essais uniques parfaits comme point de départ pour votre travail.
zu: Khiqiza izindatshana ezihlukile ezilungele ukuqala umsebenzi wakho.

source: Educators
fr: Enseignants
sw: Walimu
tw: Akyerɛkyerɛfo
zu: Abafundisi

source: Our platform is designed to simplify learning and problem-solving. Follow these simple steps to experience the power of AI in generating accurate solutions efficiently.
fr: Notre plateforme est conçue pour simplifier l’apprentissage et la résolution de problèmes. Suivez ces étapes simples pour expérimenter la puissance de l’IA dans la génération efficace de solutions précises.
sw: Jukwaa letu limeundwa kurahisisha ujifunzaji na utatuzi wa matatizo. Fuata hatua hizi rahisi kuona nguvu ya AI katika kutoa suluhisho sahihi kwa ufanisi.
tw: Platform yɛde boa ma sua ade ne nsɛm sua no mu. Di mmara yi mu de hu AI tumi ma mmuaeɛ a ɛyɛ nokware ntɛm.
zu: Ipulatifomu yethu yakhelwe ukuhlela ukufunda nokuxazulula izinkinga. Landela lezi zinyathelo ezilula ukuze uzwe amandla e-AI ekukhiqizeni izixazululo ezinembile ngokusebenza kahle.

source: Step 1: Input Your Problem
fr: Étape 1 : Entrez votre problème
sw: Hatua 1: Ingiza Tatizo Lako
tw: Step 1: Hyɛ Wo Nsɛm Mu
zu: Isinyathelo 1: Faka Inkinga Yakho

source: Our AI-powered EdTech platform is designed to help learners, educators, and researchers achieve accurate and reliable results effortlessly. Whether you’re tackling complex STEM problems, creating engaging educational content, or exploring new concepts, our intelligent assistant provides clear, step-by-step solutions you can trust. Every interaction is secure, giving you confidence that your data remains private while you focus on learning, teaching, and discovery.
zu: I-AI EdTech platform yethu yakhelwe ukusiza abafundi, othisha, nabacwaningi bathole imiphumela enembile nethembekile kalula. Noma ngabe ubhekene nezinkinga eziyinkimbinkimbi ze-STEM, wenza okuqukethwe kwezemfundo okuthokozisayo, noma uhlola imiqondo emisha, umsizi wethu ohlakaniphile unikeza izixazululo ezicacile, ngesinyathelo ngesinyathelo ongathembela kuzo. Yonke imisebenzi iphephile, ikunika ukuzethemba ukuthi idatha yakho ihlala iyimfihlo ngenkathi ugxila ekufundeni, ekufundiseni, nasekutholeni ulwazi.

source: Website Builder
tw: Wɛbsaet Siadeɛfo
